GopalSaraf/Practicals/PSDL/include/proc/pic18c601.inc
// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 0F85h
// bitfield definitions
PORTF_RF0_POSN                           equ 0000h
PORTF_RF0_POSITION                       equ 0000h
PORTF_RF0_SIZE                           equ 0001h
PORTF_RF0_LENGTH                         equ 0001h
PORTF_RF0_MASK                           equ 0001h
PORTF_RF1_POSN                           equ 0001h
PORTF_RF1_POSITION                       equ 0001h
PORTF_RF1_SIZE                           equ 0001h
PORTF_RF1_LENGTH                         equ 0001h
PORTF_RF1_MASK                           equ 0002h
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h
PORTF_AN5_POSN                           equ 0000h
PORTF_AN5_POSITION                       equ 0000h
PORTF_AN5_SIZE                           equ 0001h
PORTF_AN5_LENGTH                         equ 0001h
PORTF_AN5_MASK                           equ 0001h
PORTF_AN6_POSN                           equ 0001h
PORTF_AN6_POSITION                       equ 0001h
PORTF_AN6_SIZE                           equ 0001h
PORTF_AN6_LENGTH                         equ 0001h
PORTF_AN6_MASK                           equ 0002h
PORTF_AN7_POSN                           equ 0002h
PORTF_AN7_POSITION                       equ 0002h
PORTF_AN7_SIZE                           equ 0001h
PORTF_AN7_LENGTH                         equ 0001h
PORTF_AN7_MASK                           equ 0004h
PORTF_CSIO_POSN                          equ 0003h
PORTF_CSIO_POSITION                      equ 0003h
PORTF_CSIO_SIZE                          equ 0001h
PORTF_CSIO_LENGTH                        equ 0001h
PORTF_CSIO_MASK                          equ 0008h
PORTF_A16_POSN                           equ 0004h
PORTF_A16_POSITION                       equ 0004h
PORTF_A16_SIZE                           equ 0001h
PORTF_A16_LENGTH                         equ 0001h
PORTF_A16_MASK                           equ 0010h
PORTF_CS1_POSN                           equ 0005h
PORTF_CS1_POSITION                       equ 0005h
PORTF_CS1_SIZE                           equ 0001h
PORTF_CS1_LENGTH                         equ 0001h
PORTF_CS1_MASK                           equ 0020h
PORTF_LB_POSN                            equ 0006h
PORTF_LB_POSITION                        equ 0006h
PORTF_LB_SIZE                            equ 0001h
PORTF_LB_LENGTH                          equ 0001h
PORTF_LB_MASK                            equ 0040h
PORTF_UB_POSN                            equ 0007h
PORTF_UB_POSITION                        equ 0007h
PORTF_UB_SIZE                            equ 0001h
PORTF_UB_LENGTH                          equ 0001h
PORTF_UB_MASK                            equ 0080h
PORTF_AD16_POSN                          equ 0004h
PORTF_AD16_POSITION                      equ 0004h
PORTF_AD16_SIZE                          equ 0001h
PORTF_AD16_LENGTH                        equ 0001h
PORTF_AD16_MASK                          equ 0010h
PORTF_C2OUTF_POSN                        equ 0001h
PORTF_C2OUTF_POSITION                    equ 0001h
PORTF_C2OUTF_SIZE                        equ 0001h
PORTF_C2OUTF_LENGTH                      equ 0001h
PORTF_C2OUTF_MASK                        equ 0002h
PORTF_C1OUTF_POSN                        equ 0002h
PORTF_C1OUTF_POSITION                    equ 0002h
PORTF_C1OUTF_SIZE                        equ 0001h
PORTF_C1OUTF_LENGTH                      equ 0001h
PORTF_C1OUTF_MASK                        equ 0004h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0F86h
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_ALE_POSN                           equ 0000h
PORTG_ALE_POSITION                       equ 0000h
PORTG_ALE_SIZE                           equ 0001h
PORTG_ALE_LENGTH                         equ 0001h
PORTG_ALE_MASK                           equ 0001h
PORTG_OE_POSN                            equ 0001h
PORTG_OE_POSITION                        equ 0001h
PORTG_OE_SIZE                            equ 0001h
PORTG_OE_LENGTH                          equ 0001h
PORTG_OE_MASK                            equ 0002h
PORTG_WRL_POSN                           equ 0002h
PORTG_WRL_POSITION                       equ 0002h
PORTG_WRL_SIZE                           equ 0001h
PORTG_WRL_LENGTH                         equ 0001h
PORTG_WRL_MASK                           equ 0004h
PORTG_WRH_POSN                           equ 0003h
PORTG_WRH_POSITION                       equ 0003h
PORTG_WRH_SIZE                           equ 0001h
PORTG_WRH_LENGTH                         equ 0001h
PORTG_WRH_MASK                           equ 0008h
PORTG_BA0_POSN                           equ 0004h
PORTG_BA0_POSITION                       equ 0004h
PORTG_BA0_SIZE                           equ 0001h
PORTG_BA0_LENGTH                         equ 0001h
PORTG_BA0_MASK                           equ 0010h
PORTG_C3OUTG_POSN                        equ 0001h
PORTG_C3OUTG_POSITION                    equ 0001h
PORTG_C3OUTG_SIZE                        equ 0001h
PORTG_C3OUTG_LENGTH                      equ 0001h
PORTG_C3OUTG_MASK                        equ 0002h

