GopalSaraf/Practicals/PSDL/include/proc/pic18c601.inc
// Register: TRISF
#define TRISF TRISF
TRISF                                    equ 0F97h
// bitfield definitions
TRISF_TRISF0_POSN                        equ 0000h
TRISF_TRISF0_POSITION                    equ 0000h
TRISF_TRISF0_SIZE                        equ 0001h
TRISF_TRISF0_LENGTH                      equ 0001h
TRISF_TRISF0_MASK                        equ 0001h
TRISF_TRISF1_POSN                        equ 0001h
TRISF_TRISF1_POSITION                    equ 0001h
TRISF_TRISF1_SIZE                        equ 0001h
TRISF_TRISF1_LENGTH                      equ 0001h
TRISF_TRISF1_MASK                        equ 0002h
TRISF_TRISF2_POSN                        equ 0002h
TRISF_TRISF2_POSITION                    equ 0002h
TRISF_TRISF2_SIZE                        equ 0001h
TRISF_TRISF2_LENGTH                      equ 0001h
TRISF_TRISF2_MASK                        equ 0004h
TRISF_TRISF3_POSN                        equ 0003h
TRISF_TRISF3_POSITION                    equ 0003h
TRISF_TRISF3_SIZE                        equ 0001h
TRISF_TRISF3_LENGTH                      equ 0001h
TRISF_TRISF3_MASK                        equ 0008h
TRISF_TRISF4_POSN                        equ 0004h
TRISF_TRISF4_POSITION                    equ 0004h
TRISF_TRISF4_SIZE                        equ 0001h
TRISF_TRISF4_LENGTH                      equ 0001h
TRISF_TRISF4_MASK                        equ 0010h
TRISF_TRISF5_POSN                        equ 0005h
TRISF_TRISF5_POSITION                    equ 0005h
TRISF_TRISF5_SIZE                        equ 0001h
TRISF_TRISF5_LENGTH                      equ 0001h
TRISF_TRISF5_MASK                        equ 0020h
TRISF_TRISF6_POSN                        equ 0006h
TRISF_TRISF6_POSITION                    equ 0006h
TRISF_TRISF6_SIZE                        equ 0001h
TRISF_TRISF6_LENGTH                      equ 0001h
TRISF_TRISF6_MASK                        equ 0040h
TRISF_TRISF7_POSN                        equ 0007h
TRISF_TRISF7_POSITION                    equ 0007h
TRISF_TRISF7_SIZE                        equ 0001h
TRISF_TRISF7_LENGTH                      equ 0001h
TRISF_TRISF7_MASK                        equ 0080h
TRISF_RF0_POSN                           equ 0000h
TRISF_RF0_POSITION                       equ 0000h
TRISF_RF0_SIZE                           equ 0001h
TRISF_RF0_LENGTH                         equ 0001h
TRISF_RF0_MASK                           equ 0001h
TRISF_RF1_POSN                           equ 0001h
TRISF_RF1_POSITION                       equ 0001h
TRISF_RF1_SIZE                           equ 0001h
TRISF_RF1_LENGTH                         equ 0001h
TRISF_RF1_MASK                           equ 0002h
TRISF_RF2_POSN                           equ 0002h
TRISF_RF2_POSITION                       equ 0002h
TRISF_RF2_SIZE                           equ 0001h
TRISF_RF2_LENGTH                         equ 0001h
TRISF_RF2_MASK                           equ 0004h
TRISF_RF3_POSN                           equ 0003h
TRISF_RF3_POSITION                       equ 0003h
TRISF_RF3_SIZE                           equ 0001h
TRISF_RF3_LENGTH                         equ 0001h
TRISF_RF3_MASK                           equ 0008h
TRISF_RF4_POSN                           equ 0004h
TRISF_RF4_POSITION                       equ 0004h
TRISF_RF4_SIZE                           equ 0001h
TRISF_RF4_LENGTH                         equ 0001h
TRISF_RF4_MASK                           equ 0010h
TRISF_RF5_POSN                           equ 0005h
TRISF_RF5_POSITION                       equ 0005h
TRISF_RF5_SIZE                           equ 0001h
TRISF_RF5_LENGTH                         equ 0001h
TRISF_RF5_MASK                           equ 0020h
TRISF_RF6_POSN                           equ 0006h
TRISF_RF6_POSITION                       equ 0006h
TRISF_RF6_SIZE                           equ 0001h
TRISF_RF6_LENGTH                         equ 0001h
TRISF_RF6_MASK                           equ 0040h
TRISF_RF7_POSN                           equ 0007h
TRISF_RF7_POSITION                       equ 0007h
TRISF_RF7_SIZE                           equ 0001h
TRISF_RF7_LENGTH                         equ 0001h
TRISF_RF7_MASK                           equ 0080h

// Register: TRISG
#define TRISG TRISG
TRISG                                    equ 0F98h
// bitfield definitions
TRISG_TRISG0_POSN                        equ 0000h
TRISG_TRISG0_POSITION                    equ 0000h
TRISG_TRISG0_SIZE                        equ 0001h
TRISG_TRISG0_LENGTH                      equ 0001h
TRISG_TRISG0_MASK                        equ 0001h
TRISG_TRISG1_POSN                        equ 0001h
TRISG_TRISG1_POSITION                    equ 0001h
TRISG_TRISG1_SIZE                        equ 0001h
TRISG_TRISG1_LENGTH                      equ 0001h
TRISG_TRISG1_MASK                        equ 0002h
TRISG_TRISG2_POSN                        equ 0002h
TRISG_TRISG2_POSITION                    equ 0002h
TRISG_TRISG2_SIZE                        equ 0001h
TRISG_TRISG2_LENGTH                      equ 0001h
TRISG_TRISG2_MASK                        equ 0004h
TRISG_TRISG3_POSN                        equ 0003h
TRISG_TRISG3_POSITION                    equ 0003h
TRISG_TRISG3_SIZE                        equ 0001h
TRISG_TRISG3_LENGTH                      equ 0001h
TRISG_TRISG3_MASK                        equ 0008h
TRISG_TRISG4_POSN                        equ 0004h
TRISG_TRISG4_POSITION                    equ 0004h
TRISG_TRISG4_SIZE                        equ 0001h
TRISG_TRISG4_LENGTH                      equ 0001h
TRISG_TRISG4_MASK                        equ 0010h
TRISG_RG0_POSN                           equ 0000h
TRISG_RG0_POSITION                       equ 0000h
TRISG_RG0_SIZE                           equ 0001h
TRISG_RG0_LENGTH                         equ 0001h
TRISG_RG0_MASK                           equ 0001h
TRISG_RG1_POSN                           equ 0001h
TRISG_RG1_POSITION                       equ 0001h
TRISG_RG1_SIZE                           equ 0001h
TRISG_RG1_LENGTH                         equ 0001h
TRISG_RG1_MASK                           equ 0002h
TRISG_RG2_POSN                           equ 0002h
TRISG_RG2_POSITION                       equ 0002h
TRISG_RG2_SIZE                           equ 0001h
TRISG_RG2_LENGTH                         equ 0001h
TRISG_RG2_MASK                           equ 0004h
TRISG_RG3_POSN                           equ 0003h
TRISG_RG3_POSITION                       equ 0003h
TRISG_RG3_SIZE                           equ 0001h
TRISG_RG3_LENGTH                         equ 0001h
TRISG_RG3_MASK                           equ 0008h
TRISG_RG4_POSN                           equ 0004h
TRISG_RG4_POSITION                       equ 0004h
TRISG_RG4_SIZE                           equ 0001h
TRISG_RG4_LENGTH                         equ 0001h
TRISG_RG4_MASK                           equ 0010h

// Register: MEMCON
#define MEMCON MEMCON
MEMCON                                   equ 0F9Ch
// bitfield definitions
MEMCON_WM_POSN                           equ 0000h
MEMCON_WM_POSITION                       equ 0000h
MEMCON_WM_SIZE                           equ 0002h
MEMCON_WM_LENGTH                         equ 0002h
MEMCON_WM_MASK                           equ 0003h
MEMCON_WAIT_POSN                         equ 0004h
MEMCON_WAIT_POSITION                     equ 0004h
MEMCON_WAIT_SIZE                         equ 0002h
MEMCON_WAIT_LENGTH                       equ 0002h
MEMCON_WAIT_MASK                         equ 0030h
MEMCON_PGRM_POSN                         equ 0006h
MEMCON_PGRM_POSITION                     equ 0006h
MEMCON_PGRM_SIZE                         equ 0001h
MEMCON_PGRM_LENGTH                       equ 0001h
MEMCON_PGRM_MASK                         equ 0040h
MEMCON_EBDIS_POSN                        equ 0007h
MEMCON_EBDIS_POSITION                    equ 0007h
MEMCON_EBDIS_SIZE                        equ 0001h
MEMCON_EBDIS_LENGTH                      equ 0001h
MEMCON_EBDIS_MASK                        equ 0080h
MEMCON_WM0_POSN                          equ 0000h
MEMCON_WM0_POSITION                      equ 0000h
MEMCON_WM0_SIZE                          equ 0001h
MEMCON_WM0_LENGTH                        equ 0001h
MEMCON_WM0_MASK                          equ 0001h
MEMCON_WM1_POSN                          equ 0001h
MEMCON_WM1_POSITION                      equ 0001h
MEMCON_WM1_SIZE                          equ 0001h
MEMCON_WM1_LENGTH                        equ 0001h
MEMCON_WM1_MASK                          equ 0002h
MEMCON_WAIT0_POSN                        equ 0004h
MEMCON_WAIT0_POSITION                    equ 0004h
MEMCON_WAIT0_SIZE                        equ 0001h
MEMCON_WAIT0_LENGTH                      equ 0001h
MEMCON_WAIT0_MASK                        equ 0010h
MEMCON_WAIT1_POSN                        equ 0005h
MEMCON_WAIT1_POSITION                    equ 0005h
MEMCON_WAIT1_SIZE                        equ 0001h
MEMCON_WAIT1_LENGTH                      equ 0001h
MEMCON_WAIT1_MASK                        equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0F9Dh
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_TMR2IE_POSN                         equ 0001h
PIE1_TMR2IE_POSITION                     equ 0001h
PIE1_TMR2IE_SIZE                         equ 0001h
PIE1_TMR2IE_LENGTH                       equ 0001h
PIE1_TMR2IE_MASK                         equ 0002h
PIE1_CCP1IE_POSN                         equ 0002h
PIE1_CCP1IE_POSITION                     equ 0002h
PIE1_CCP1IE_SIZE                         equ 0001h
PIE1_CCP1IE_LENGTH                       equ 0001h
PIE1_CCP1IE_MASK                         equ 0004h
PIE1_SSPIE_POSN                          equ 0003h
PIE1_SSPIE_POSITION                      equ 0003h
PIE1_SSPIE_SIZE                          equ 0001h
PIE1_SSPIE_LENGTH                        equ 0001h
PIE1_SSPIE_MASK                          equ 0008h
PIE1_TXIE_POSN                           equ 0004h
PIE1_TXIE_POSITION                       equ 0004h
PIE1_TXIE_SIZE                           equ 0001h
PIE1_TXIE_LENGTH                         equ 0001h
PIE1_TXIE_MASK                           equ 0010h
PIE1_RCIE_POSN                           equ 0005h
PIE1_RCIE_POSITION                       equ 0005h
PIE1_RCIE_SIZE                           equ 0001h
PIE1_RCIE_LENGTH                         equ 0001h
PIE1_RCIE_MASK                           equ 0020h
PIE1_ADIE_POSN                           equ 0006h
PIE1_ADIE_POSITION                       equ 0006h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0040h
PIE1_TX1IE_POSN                          equ 0004h
PIE1_TX1IE_POSITION                      equ 0004h
PIE1_TX1IE_SIZE                          equ 0001h
PIE1_TX1IE_LENGTH                        equ 0001h
PIE1_TX1IE_MASK                          equ 0010h
PIE1_RC1IE_POSN                          equ 0005h
PIE1_RC1IE_POSITION                      equ 0005h
PIE1_RC1IE_SIZE                          equ 0001h
PIE1_RC1IE_LENGTH                        equ 0001h
PIE1_RC1IE_MASK                          equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0F9Eh
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_CCP1IF_POSN                         equ 0002h
PIR1_CCP1IF_POSITION                     equ 0002h
PIR1_CCP1IF_SIZE                         equ 0001h
PIR1_CCP1IF_LENGTH                       equ 0001h
PIR1_CCP1IF_MASK                         equ 0004h
PIR1_SSPIF_POSN                          equ 0003h
PIR1_SSPIF_POSITION                      equ 0003h
PIR1_SSPIF_SIZE                          equ 0001h
PIR1_SSPIF_LENGTH                        equ 0001h
PIR1_SSPIF_MASK                          equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TX1IF_POSN                          equ 0004h
PIR1_TX1IF_POSITION                      equ 0004h
PIR1_TX1IF_SIZE                          equ 0001h
PIR1_TX1IF_LENGTH                        equ 0001h
PIR1_TX1IF_MASK                          equ 0010h
PIR1_RC1IF_POSN                          equ 0005h
PIR1_RC1IF_POSITION                      equ 0005h
PIR1_RC1IF_SIZE                          equ 0001h
PIR1_RC1IF_LENGTH                        equ 0001h
PIR1_RC1IF_MASK                          equ 0020h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0F9Fh
// bitfield definitions
IPR1_TMR1IP_POSN                         equ 0000h
IPR1_TMR1IP_POSITION                     equ 0000h
IPR1_TMR1IP_SIZE                         equ 0001h
IPR1_TMR1IP_LENGTH                       equ 0001h
IPR1_TMR1IP_MASK                         equ 0001h
IPR1_TMR2IP_POSN                         equ 0001h
IPR1_TMR2IP_POSITION                     equ 0001h
IPR1_TMR2IP_SIZE                         equ 0001h
IPR1_TMR2IP_LENGTH                       equ 0001h
IPR1_TMR2IP_MASK                         equ 0002h
IPR1_CCP1IP_POSN                         equ 0002h
IPR1_CCP1IP_POSITION                     equ 0002h
IPR1_CCP1IP_SIZE                         equ 0001h
IPR1_CCP1IP_LENGTH                       equ 0001h
IPR1_CCP1IP_MASK                         equ 0004h
IPR1_SSPIP_POSN                          equ 0003h
IPR1_SSPIP_POSITION                      equ 0003h
IPR1_SSPIP_SIZE                          equ 0001h
IPR1_SSPIP_LENGTH                        equ 0001h
IPR1_SSPIP_MASK                          equ 0008h
IPR1_TXIP_POSN                           equ 0004h
IPR1_TXIP_POSITION                       equ 0004h
IPR1_TXIP_SIZE                           equ 0001h
IPR1_TXIP_LENGTH                         equ 0001h
IPR1_TXIP_MASK                           equ 0010h
IPR1_RCIP_POSN                           equ 0005h
IPR1_RCIP_POSITION                       equ 0005h
IPR1_RCIP_SIZE                           equ 0001h
IPR1_RCIP_LENGTH                         equ 0001h
IPR1_RCIP_MASK                           equ 0020h
IPR1_ADIP_POSN                           equ 0006h
IPR1_ADIP_POSITION                       equ 0006h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0040h
IPR1_TX1IP_POSN                          equ 0004h
IPR1_TX1IP_POSITION                      equ 0004h
IPR1_TX1IP_SIZE                          equ 0001h
IPR1_TX1IP_LENGTH                        equ 0001h
IPR1_TX1IP_MASK                          equ 0010h
IPR1_RC1IP_POSN                          equ 0005h
IPR1_RC1IP_POSITION                      equ 0005h
IPR1_RC1IP_SIZE                          equ 0001h
IPR1_RC1IP_LENGTH                        equ 0001h
IPR1_RC1IP_MASK                          equ 0020h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0FA0h
// bitfield definitions
PIE2_CCP2IE_POSN                         equ 0000h
PIE2_CCP2IE_POSITION                     equ 0000h
PIE2_CCP2IE_SIZE                         equ 0001h
PIE2_CCP2IE_LENGTH                       equ 0001h
PIE2_CCP2IE_MASK                         equ 0001h
PIE2_TMR3IE_POSN                         equ 0001h
PIE2_TMR3IE_POSITION                     equ 0001h
PIE2_TMR3IE_SIZE                         equ 0001h
PIE2_TMR3IE_LENGTH                       equ 0001h
PIE2_TMR3IE_MASK                         equ 0002h
PIE2_LVDIE_POSN                          equ 0002h
PIE2_LVDIE_POSITION                      equ 0002h
PIE2_LVDIE_SIZE                          equ 0001h
PIE2_LVDIE_LENGTH                        equ 0001h
PIE2_LVDIE_MASK                          equ 0004h
PIE2_BCLIE_POSN                          equ 0003h
PIE2_BCLIE_POSITION                      equ 0003h
PIE2_BCLIE_SIZE                          equ 0001h
PIE2_BCLIE_LENGTH                        equ 0001h
PIE2_BCLIE_MASK                          equ 0008h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0FA1h
// bitfield definitions
PIR2_CCP2IF_POSN                         equ 0000h
PIR2_CCP2IF_POSITION                     equ 0000h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0001h
PIR2_TMR3IF_POSN                         equ 0001h
PIR2_TMR3IF_POSITION                     equ 0001h
PIR2_TMR3IF_SIZE                         equ 0001h
PIR2_TMR3IF_LENGTH                       equ 0001h
PIR2_TMR3IF_MASK                         equ 0002h
PIR2_LVDIF_POSN                          equ 0002h
PIR2_LVDIF_POSITION                      equ 0002h
PIR2_LVDIF_SIZE                          equ 0001h
PIR2_LVDIF_LENGTH                        equ 0001h
PIR2_LVDIF_MASK                          equ 0004h
PIR2_BCLIF_POSN                          equ 0003h
PIR2_BCLIF_POSITION                      equ 0003h
PIR2_BCLIF_SIZE                          equ 0001h
PIR2_BCLIF_LENGTH                        equ 0001h
PIR2_BCLIF_MASK                          equ 0008h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0FA2h
// bitfield definitions
IPR2_CCP2IP_POSN                         equ 0000h
IPR2_CCP2IP_POSITION                     equ 0000h
IPR2_CCP2IP_SIZE                         equ 0001h
IPR2_CCP2IP_LENGTH                       equ 0001h
IPR2_CCP2IP_MASK                         equ 0001h
IPR2_TMR3IP_POSN                         equ 0001h
IPR2_TMR3IP_POSITION                     equ 0001h
IPR2_TMR3IP_SIZE                         equ 0001h
IPR2_TMR3IP_LENGTH                       equ 0001h
IPR2_TMR3IP_MASK                         equ 0002h
IPR2_LVDIP_POSN                          equ 0002h
IPR2_LVDIP_POSITION                      equ 0002h
IPR2_LVDIP_SIZE                          equ 0001h
IPR2_LVDIP_LENGTH                        equ 0001h
IPR2_LVDIP_MASK                          equ 0004h
IPR2_BCLIP_POSN                          equ 0003h
IPR2_BCLIP_POSITION                      equ 0003h
IPR2_BCLIP_SIZE                          equ 0001h
IPR2_BCLIP_LENGTH                        equ 0001h
IPR2_BCLIP_MASK                          equ 0008h

// Register: CSELIO
#define CSELIO CSELIO
CSELIO                                   equ 0FA6h
// bitfield definitions
CSELIO_CSIO_POSN                         equ 0000h
CSELIO_CSIO_POSITION                     equ 0000h
CSELIO_CSIO_SIZE                         equ 0008h
CSELIO_CSIO_LENGTH                       equ 0008h
CSELIO_CSIO_MASK                         equ 00FFh
CSELIO_CSIO0_POSN                        equ 0000h
CSELIO_CSIO0_POSITION                    equ 0000h
CSELIO_CSIO0_SIZE                        equ 0001h
CSELIO_CSIO0_LENGTH                      equ 0001h
CSELIO_CSIO0_MASK                        equ 0001h
CSELIO_CSIO1_POSN                        equ 0001h
CSELIO_CSIO1_POSITION                    equ 0001h
CSELIO_CSIO1_SIZE                        equ 0001h
CSELIO_CSIO1_LENGTH                      equ 0001h
CSELIO_CSIO1_MASK                        equ 0002h
CSELIO_CSIO2_POSN                        equ 0002h
CSELIO_CSIO2_POSITION                    equ 0002h
CSELIO_CSIO2_SIZE                        equ 0001h
CSELIO_CSIO2_LENGTH                      equ 0001h
CSELIO_CSIO2_MASK                        equ 0004h
CSELIO_CSIO3_POSN                        equ 0003h
CSELIO_CSIO3_POSITION                    equ 0003h
CSELIO_CSIO3_SIZE                        equ 0001h
CSELIO_CSIO3_LENGTH                      equ 0001h
CSELIO_CSIO3_MASK                        equ 0008h
CSELIO_CSIO4_POSN                        equ 0004h
CSELIO_CSIO4_POSITION                    equ 0004h
CSELIO_CSIO4_SIZE                        equ 0001h
CSELIO_CSIO4_LENGTH                      equ 0001h
CSELIO_CSIO4_MASK                        equ 0010h
CSELIO_CSIO5_POSN                        equ 0005h
CSELIO_CSIO5_POSITION                    equ 0005h
CSELIO_CSIO5_SIZE                        equ 0001h
CSELIO_CSIO5_LENGTH                      equ 0001h
CSELIO_CSIO5_MASK                        equ 0020h
CSELIO_CSIO6_POSN                        equ 0006h
CSELIO_CSIO6_POSITION                    equ 0006h
CSELIO_CSIO6_SIZE                        equ 0001h
CSELIO_CSIO6_LENGTH                      equ 0001h
CSELIO_CSIO6_MASK                        equ 0040h
CSELIO_CSIO7_POSN                        equ 0007h
CSELIO_CSIO7_POSITION                    equ 0007h
CSELIO_CSIO7_SIZE                        equ 0001h
CSELIO_CSIO7_LENGTH                      equ 0001h
CSELIO_CSIO7_MASK                        equ 0080h

